Enums/ПричиныОтсутствийЗаявокКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ПричиныОтсутствийЗаявокКабинетСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Опоздание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Болезнь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчебныйОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускЗаСвойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеДела</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДниУходаЗаДетьмиИнвалидами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныНетрудоспособности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ПричиныНетрудоспособности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщееЗаболевание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профзаболевание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТравмаНаПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карантин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Протезирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПриДолечивании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуЗаВзрослым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЗаявкиСотрудниковФормыКлиентБазовый/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура СоздатьНовыйДокументОтпуск(Форма) Экспорт

	ОткрытьФорму("Документ.Отпуск.Форма.ФормаДокумента", ПараметрыЗаполненияДокументаОтпуск(Форма), Форма);

КонецПроцедуры

Функция ПараметрыЗаполненияДокументаОтпуск(Форма)
	
	Объект = Форма.Объект;
	
	ПараметрыЗаполнения = Новый Структура;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Ссылка", 		Неопределено);
	ДанныеЗаполнения.Вставить("Действие", 		"Заполнить");
	ДанныеЗаполнения.Вставить("Сотрудник", 		Объект.Сотрудник);
	ДанныеЗаполнения.Вставить("Организация", 	Объект.Организация);
	
	КоличествоДнейОтпуска = ЗаявкиСотрудниковВызовСервераБазовый.КоличествоДнейОтпуска(Объект.ДатаНачала, Объект.ДатаОкончания, Объект.Организация);
	ДанныеЗаполнения.Вставить("ДатаНачалаОсновногоОтпуска", 	Объект.ДатаНачала);
	ДанныеЗаполнения.Вставить("ДатаОкончанияОсновногоОтпуска", 	Объект.ДатаОкончания);
	ДанныеЗаполнения.Вставить("КоличествоДнейОсновногоОтпуска", КоличествоДнейОтпуска);
	
	ПараметрыЗаполнения.Вставить("Основание", ДанныеЗаполнения);
		
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция ПараметрыЗаполненияДокументаОтпускБезОплаты(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	ПараметрыЗаполнения = Новый Структура("Основание");
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Ссылка", 		Неопределено);
	ДанныеЗаполнения.Вставить("Действие", 		"Заполнить");
	ДанныеЗаполнения.Вставить("Сотрудник", 		Объект.Сотрудник);
	ДанныеЗаполнения.Вставить("Организация", 	Объект.Организация);
	ДанныеЗаполнения.Вставить("ДатаНачала", 	Объект.ДатаНачала);
	ДанныеЗаполнения.Вставить("ДатаОкончания", 	Объект.ДатаОкончания);
	
	ПараметрыЗаполнения.Основание = ДанныеЗаполнения;
		
	Возврат ПараметрыЗаполнения;

КонецФункции

Процедура СоздатьНовыйДокументПоОтсутствию(Форма) Экспорт
	
	ОткрытьФорму("Документ.БольничныйЛист.ФормаОбъекта", ПараметрыЗаполненияДокументаБольничный(Форма), Форма);
	
КонецПроцедуры

Функция ПараметрыЗаполненияДокументаБольничный(Форма)
	
	Объект = Форма.Объект;
	
	ПараметрыЗаполнения = Новый Структура("Основание");
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Действие", "ЗаполнитьПоПараметрамЗаполнения");
	ДанныеЗаполнения.Вставить("ДатаНачала", 			Объект.ДатаНачала);
	ДанныеЗаполнения.Вставить("ДатаНачалаОплаты", 		Объект.ДатаНачала);
	ДанныеЗаполнения.Вставить("ДатаОкончания", 			Объект.ДатаОкончания);
	ДанныеЗаполнения.Вставить("ДатаОкончанияОплаты", 	Объект.ДатаОкончания);
	ДанныеЗаполнения.Вставить("Организация", 			Объект.Организация);
	ДанныеЗаполнения.Вставить("Сотрудник", 				Объект.Сотрудник);
	
	ПериодРасчетаСреднего = УчетПособийСоциальногоСтрахованияКлиентСервер.ПериодРасчетаСреднегоЗаработкаФСС(Объект.ДатаНачала);
	ДанныеЗаполнения.Вставить("ПериодРасчетаСреднегоЗаработкаПервыйГод", Год(ПериодРасчетаСреднего.ДатаНачала));
	ДанныеЗаполнения.Вставить("ПериодРасчетаСреднегоЗаработкаВторойГод", Год(ПериодРасчетаСреднего.ДатаОкончания));
	
	Если Объект.ПричинаОтсутствия = ПредопределенноеЗначение("Перечисление.ПричиныОтсутствийЗаявокКабинетСотрудника.ОтпускПоБеременностиИРодам") Тогда
		ДанныеЗаполнения.Вставить("ПричинаНетрудоспособности", ПредопределенноеЗначение("Перечисление.ПричиныНетрудоспособности.ПоБеременностиИРодам"));
	КонецЕсли;
		
	ПараметрыЗаполнения.Основание = ДанныеЗаполнения;
		
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция ЗначенияДляВыбораДокументаПоОтсутствию(Форма) Экспорт

Объект = Форма.Объект;
	Отбор = Новый Структура;
	
	Если Объект.ПричинаОтсутствия = ПредопределенноеЗначение("Перечисление.ПричиныОтсутствийЗаявокКабинетСотрудника.Болезнь") Тогда
		Отбор.Вставить("Организация", Объект.Организация);
		Отбор.Вставить("Сотрудник", Объект.Сотрудник);
	ИначеЕсли Объект.ПричинаОтсутствия = ПредопределенноеЗначение("Перечисление.ПричиныОтсутствийЗаявокКабинетСотрудника.ОтпускПоБеременностиИРодам") Тогда
		Отбор.Вставить("Организация", Объект.Организация);
		Отбор.Вставить("Сотрудник", Объект.Сотрудник);
	КонецЕсли;
	
	ЗначенияДляВыбора = ЗаявкиСотрудниковВызовСервераБазовый.ЗначенияДляВыбораДокументаПоОтсутствию(Объект.ПричинаОтсутствия);
	
	Возврат Новый Структура("Отбор,ЗначенияДляВыбораВидаДокумента", Отбор, ЗначенияДляВыбора)

КонецФункции

#КонецОбласти
